/**
 * Custom configuration
 * (sails.config.custom)
 *
 * One-off settings specific to your application.
 *
 * For more information on custom configuration, visit:
 * https://sailsjs.com/config/custom
 */

module.exports.custom = {

  /***************************************************************************
  *                                                                          *
  * Any other custom config this Sails app should use during development.    *
  *                                                                          *
  ***************************************************************************/
  // mailgunDomain: 'transactional-mail.example.com',
  // mailgunSecret: 'key-testkeyb183848139913858e8abd9a3',
  // stripeSecret: 'sk_test_Zzd814nldl91104qor5911gjald',
  // …
  rememberMeCookieMaxAge: 30 * 24 * 60 * 60 * 1000, // 30 days

  brands: ['阿尔法·罗密欧', '阿斯顿·马丁', '奥迪', '巴博斯', '宝骏', '宝马', '宝沃', '保时捷', '北京', '北京清行', '北汽昌河', '北汽道达', '北汽幻速', '北汽绅宝', '北汽威旺', '北汽新能源', '北汽制造', '奔驰', '奔腾', '本田', '比速汽车', '比亚迪', '标致', '别克', '宾利', '成功汽车', '大乘汽车', '大众', '道奇', '电咖', '东风', '东风·瑞泰特', '东风风度', '东风风光', '东风风神', '东风风行', '东风小康', '东南', '法拉利', '菲亚特', '丰田', '福迪', '福汽启腾', '福特', '福田', '福田乘用车', '观致', '广汽传祺', '广汽吉奥', '广汽集团', '广汽新能源', '国金汽车', '哈飞', '哈弗', '海格', '海马', '汉腾汽车', '恒天', '红旗', '红星汽车', '华凯', '华骐', '华颂', '华泰', '华泰新能源', '黄海', '吉利汽车', '江淮', '江铃', '江铃集团轻汽', '江铃集团新能源', '捷豹', '捷途', '金杯', '金龙', '金旅', '九龙', '君马汽车', '卡尔森', '卡升', '卡威', '开瑞', '凯迪拉克', '凯翼', '克莱斯勒', '兰博基尼', '劳斯莱斯', '雷克萨斯', '雷诺', '力帆汽车', '猎豹汽车', '林肯', '铃木', '领克', '领途汽车', '陆地方舟', '陆风', '路虎', '路特斯', '马自达', '玛莎拉蒂', '迈凯伦', '名爵', '摩根', '纳智捷', '南京金龙', '讴歌', '欧拉', '欧尚汽车', '帕加尼', '奇瑞', '启辰', '起亚', '前途', '乔治·巴顿', '庆铃汽车', '全球鹰', '日产', '荣威', '容大智造', '如虎', '瑞驰新能源', '三菱', '陕汽通家', '上汽大通', '双龙', '斯巴鲁', '斯达泰克', '斯柯达', '泰卡特', '特斯拉', '腾势', '威麟', '威马汽车', '潍柴英致', '蔚来', '沃尔沃', '五菱汽车', '五十铃', '现代', '新凯', '新特汽车', '鑫源', '雪佛兰', '雪铁龙', '野马汽车', '一汽', '依维柯', '英菲尼迪', '永源', '宇通客车', '驭胜', '裕路', '云度', '云雀汽车', '长安', '长安跨越', '长安欧尚', '长安轻型车', '长城', '之诺', '知豆', '中华', '中兴', '众泰', 'AC Schnitzer', 'ALPINA', 'DS', 'GMC', 'Jeep', 'KTM', 'LITE', 'LOCAL MOTORS', 'Lorinser', 'MINI', 'Polestar', 'smart', 'SWM斯威汽车', 'WEY'],

  klasses: ['大型车', '大型SUV', '紧凑型车', '紧凑型SUV', '跑车', '皮卡', '轻客', '微卡', '微面', '微型车', '小型车', '小型SUV', '中大型车', '中大型SUV', '中型车', '中型SUV', 'MPV'],

  energies: ['汽油', '油电混合', '柴油', '纯电动', '插电式混合动力', '增程式'],

  drives: ['后置后驱', '后置四驱', '前置后驱', '前置前驱', '前置四驱', '中置后驱', '中置四驱'],

  structs: ['0门2座软顶敞篷车', '2门2座软顶敞篷车', '2门2座三厢车', '2门2座硬顶敞篷车', '2门2座硬顶跑车', '2门2座SUV', '2门4座软顶敞篷车', '2门4座三厢车', '2门4座硬顶敞篷车', '2门4座硬顶跑车', '2门4座SUV', '3门2座两厢车', '3门2座软顶敞篷车', '3门4座两厢车', '3门4座掀背车', '3门4座硬顶跑车', '3门4座SUV', '3门6座SUV', '3门8座SUV', '4门2座', '4门3座三厢车', '4门4座两厢车', '4门4座三厢车', '4门5座', '4门5座两厢车', '4门5座旅行车', '4门5座三厢车', '4门5座SUV', '4门6座', '4门6座SUV', '4门7座', '4门8座SUV', '4门9座', '5门12座', '5门2座', '5门3座SUV', '5门4座', '5门4座两厢车', '5门4座掀背车', '5门4座SUV', '5门5座', '5门5座两厢车', '5门5座旅行车', '5门5座三厢车', '5门5座掀背车', '5门5座SUV', '5门6座', '5门6座两厢车', '5门6座SUV', '5门7座', '5门7座两厢车', '5门7座SUV', '5门8座', '5门8座SUV', '6门12座', '6门5座两厢车', '6门7座', '货车', '客车'],

  environStans: ['国III', '国IV', '国IV(国V)', '国IV(国V)+OBD', '国IV/国V', '国IV/京V', '国IV+OBD', '国V', '国V(国VI)', '国V+OBD', '国VI', '欧III', '欧IV', '欧IV+OBD', '欧V', '欧V+OBD', '欧VI']
};